# define _CRT_SECURE_NO_WARNINGS 1
/********************************计算1/1-1/2+1/3-1/4····-1/100***********************/
# include <stdio.h>
//int main()
//{
//	int i = 0;
//	float sum = 0;
//	for (i = 1; i <= 100; i++)
//	{
//		if (i%2 != 0)
//		sum += 1.0 / i;
//		else sum -=1.0 / i;
//	}
//	printf("%f\n", sum);
//	//方法2：
//	double sum2 = 0;
//	int flag = 1;
//	for (i = 1; i <= 100; i++)
//	{
//		
//			sum2 +=flag* 1.0 / i;
//			flag = -flag;
//	}
//	printf("%lf\n",sum2);
//	return 0;
//}


/**************************************找出十个数字中最大的那个***************************/
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		scanf("%d",&arr[i]);
//	}
	/*int max = 0;
	for (i = 0; i < sz; i++)
	{
		if (max < arr[i])
			max = arr[i];
	}
	*/
	//这个代码这样写是错误的，因为假如输入的十个数字都是负数，最大值会是0
	//因此要用下面这种方法
//	int max = arr[0];
//	for (i = 1; i < sz; i++)
//	{
//		if (max < arr[i])
//			max = arr[i];
//	}
//	printf("max = %d\n",max);
//	return 0;
//}


/***************************************打印乘法口诀表**************************/
int main()
{
	int i = 0;
	int j = 0;
	for (j = 1; j <= 9; j++)
	{
	
	for (i = 1; i <= j; i++)
	{
		//printf("%d x %d = %d ",j,i,j*i);//%2d表示至少打印2个字符，若结果只有一位，空格在前结果在后，共两位
										//%-2d就代表空格在后
		printf("%d x %d = %-2d ", j, i, j*i);
	}
	printf("\n");
	}
	return 0;
}

/****************************return a,b;返回的其实是b***************************/
/***************************高内聚低耦合的含义**********************************/
//高内聚：所有工作尽量由我自己来完成
//低耦合：尽量不要跟别的程序，函数有关联，也就是通用性更强